АлогистикТест2/src/Documents/алк_УстановкаПлановыхПоказателей/алк_УстановкаПлановыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаПлановыхПоказателей</name>
  <registerRecords>InformationRegister.алк_ПлановыеПоказателиПроизводства</registerRecords>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБюджет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.алк_ПлановыеПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СменаУдалить</name>
      <type>
        <types>EnumRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.алк_Смены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_УстановкаПлановыхПоказателей/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(Документ, ДополнительныеСвойства) Экспорт
	
	ДополнительныеСвойства.Вставить("ПлановыеПоказателиПроизводства", ПолучитьПлановыеПоказателиПроизводства(Документ));
	
КонецПроцедуры

Функция ПолучитьПлановыеПоказателиПроизводства(Документ)
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	алк_УстановкаПлановыхПоказателейПоказатели.Период,
	|	алк_УстановкаПлановыхПоказателейПоказатели.Смена,
	|	алк_УстановкаПлановыхПоказателейПоказатели.Показатель,
	|	алк_УстановкаПлановыхПоказателейПоказатели.Значение,
	|	алк_УстановкаПлановыхПоказателейПоказатели.Ссылка.ЭтоБюджет,
	|	ИСТИНА КАК Активность
	|ИЗ
	|	Документ.алк_УстановкаПлановыхПоказателей.Показатели КАК алк_УстановкаПлановыхПоказателейПоказатели
	|ГДЕ
	|	алк_УстановкаПлановыхПоказателейПоказатели.Ссылка = &Документ");
	Запрос.УстановитьПараметр("Документ", Документ);
	ТаблицаРегистра = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРегистра;

КонецФункции

Процедура ДобавитьДвижениеРегистраПлановыеПоказателиПроизводства(Документ, ДополнительныеСвойства, Отказ) Экспорт
	
	Если ДополнительныеСвойства.ПлановыеПоказателиПроизводства.Количество() = 0 тогда
		Сообщить("Не указаны производственные показатели, либо за выбранный период нет рабочих дней");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Движения = Документ.Движения.алк_ПлановыеПоказателиПроизводства;
	Движения.Записывать = Истина;
	
	Движения.Загрузить(ДополнительныеСвойства.ПлановыеПоказателиПроизводства);

КонецПроцедуры
